# Реализуйте функцию visualize(), которая подсчитывает сколько монет 
# каждого номинала есть в копилке и показывает результат в виде графика. 
# Каждый столбец графика — стопка монет опредлённого номинала.
# Для простоты условимся, что монеты в копилке всегда есть, 
# и их количество не ограничено, а номинал может быть любым.
# Функция принимает на вход список или кортеж с числами 
# и возвращает график в виде строки. Необязательный аргумент bar_char 
# определяет символ, с помощью которого рисуется график. 
# Значение по умолчанию — знак рубля (₽).
# Для решения используйте встроенный инструмент — Counter.
