# В рамках этого испытания вы реализуете небольшой набор функций, 
# работающих с отрезками прямых на двухмерной плоскости. 
# Отрезок в нашем случае будет кодироваться в виде пары пар и выглядеть как-то так: 
# ((x1, y1), (x2, y2)) (вложенные пары — это концы отрезка). 
# Вам нужно реализовать четыре функции:
# 1. is_degenerated() должна возвращать истину, 
# если отрезок вырожден в точку (начало и конец совпадают);
# 2. is_vertical() должна возвращать "истину", если отрезок — вертикальный;
# 3. is_horizontal() должна возвращать "истину", если отрезок — горизонтальный;
# 4. is_inclined() должна возвращать "истину", 
# если отрезок — наклонный (не вертикальный и не горизонтальный).


def is_degenerated():
  """Функция возвращает истину,
  если отрезок ((x1, y1), (x2, y2))
  вырожден в точку (начало и конец совпадают)
  """
  pass
  


def is_vertical():
  """Функция возвращает истину,
  если отрезок ((x1, y1), (x2, y2))
  вертикальный
  """
  pass


def is_horizontal():
  """Функция возвращает истину,
  если отрезок ((x1, y1), (x2, y2))
  горизонтальный
  """
  pass


def is_inclined():
  """Функция возвращает истину,
  если отрезок ((x1, y1), (x2, y2))
  наклонный (не вертикальный и не горизонтальный)
  """
  pass
