# В рамках этого испытания вы реализуете небольшой набор функций, работающих с отрезками прямых на двухмерной плоскости. 
# Отрезок в нашем случае будет кодироваться в виде пары пар и выглядеть как-то так: ((x1, y1), (x2, y2)) (вложенные пары — это концы отрезка). 
# Вам нужно реализовать четыре функции:
# 1. is_degenerated() должна возвращать истину, если отрезок вырожден в точку (начало и конец совпадают);
# 2. is_vertical() должна возвращать "истину", если отрезок — вертикальный;
# 3. is_horizontal() должна возвращать "истину", если отрезок — горизонтальный;
# 4. is_inclined() должна возвращать "истину", если отрезок — наклонный (не вертикальный и не горизонтальный).
