# Реализуйте функцию gen_diff, которая
# сравнивает два словаря и возвращает
# результат сравнения в виде словаря.
# Ключами результирующего словаря будут
# все ключи из двух входящих, а значением
# строка с описанием отличий: added,
# deleted, changed или unchanged.
# Возможные значения:
# added — ключ отсутствовал в первом
# словаре, но был добавлен во второй
# deleted — ключ был в первом словаре,
# но отсутствует во втором
# changed — ключ присутствовал и в первом
# и во втором словаре, но значения отличаются
# unchanged — ключ присутствовал и в первом
# и во втором словаре с одинаковыми значениями
